Revit 2024 API
TessellatedShapeBuilderResult.GetNumberOfFaceSets Method
 Gets number of face sets for which 'this' result was obtained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public int GetNumberOfFaceSets()
Visual Basic
Public Function GetNumberOfFaceSets As Integer
Visual C++
public:
int GetNumberOfFaceSets()
Return Value
 The number of face sets.
See Also
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace